In [7]:
import numpy as np
import pandas as pd

In [8]:
np.set_printoptions(precision=2)

**Считываем данные из файла**

In [9]:
data = pd.read_csv("../../data/beauty.csv", sep=";")

In [10]:
type(data)

pandas.core.frame.DataFrame

**Смотрим на первые 5 строк**

In [11]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [12]:
data.shape

(1260, 10)

**Краткая статистика – info и describe**

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   wage      1260 non-null   float64
 1   exper     1260 non-null   int64
 2   union     1260 non-null   int64
 3   goodhlth  1260 non-null   int64
 4   black     1260 non-null   int64
 5   female    1260 non-null   int64
 6   married   1260 non-null   int64
 7   service   1260 non-null   int64
 8   educ      1260 non-null   int64
 9   looks     1260 non-null   int64
dtypes: float64(1), int64(9)
memory usage: 98.6 KB

In [16]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

**Индексация**

In [17]:
data["exper"].head()

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

**loc и iloc**

In [18]:
data.loc[0:5, ["wage", "female"]]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [19]:
data.iloc[:, 2:4].head()

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

**Логическая индексация**

In [ ]:
data[data["female"] == 1]["wage"].mean(), data[data["female"] == 0]["wage"].mean()

In [ ]:
data[(data["female"] == 0) & (data["married"] == 1)]["wage"].median(), data[
    (data["female"] == 0) & (data["married"] == 0)
]["wage"].median()

**Groupby**

In [ ]:
for look, sub_df in data.groupby("looks"):
    print(look)

    # что угодно
    print(sub_df["goodhlth"].mean())

In [ ]:
data.groupby("looks")[["wage", "exper"]].agg(np.median)

**Сводная таблица**

In [ ]:
pd.crosstab(data["female"], data["married"])

In [ ]:
pd.crosstab(data["female"], data["looks"])

**Добавление столбцов (построение признаков)**

In [ ]:
data["is_rich"] = (data["wage"] > data["wage"].quantile(0.75)).astype("int64")

In [ ]:
data.head()

In [ ]:
data["rubbish"] = 0.56 * data["wage"] + 0.32 * data["exper"]

**map и apply**

In [ ]:
def string_gender(female):
    return "female" if female else "male"

In [ ]:
d = {1: "union", 0: "non-union"}

In [ ]:
data["union"].map(d).head()

In [ ]:
data["female"].apply(lambda female: "female" if female else "male").head()